dany994/vak-opensource/trunk/microcontrollers/pic32prog/adapter-pickit2.c
/*
 * Чтение блока памяти размером, кратным 1 килобайту.
 */
static void pickit2_read_data (adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;
    unsigned char buf [64];
    unsigned words_read;

//fprintf (stderr, "PICkit2: read %d bytes from %08x\n", nwords*4, addr);
    if (! a->use_executable) {
        /* Without PE. */
        for (; nwords > 0; nwords--) {
            *data++ = pickit2_read_word (adapter, addr);
            addr += 4;
        }
        return;
    }

    /* Use PE to read memory. */
    for (words_read = 0; words_read < nwords; ) {
        /* Download addresses for 8 script runs. */
        unsigned i, k = 0;
        memset (buf, CMD_END_OF_BUFFER, 64);
        buf[k++] = CMD_CLEAR_DOWNLOAD_BUFFER;
        buf[k++] = CMD_DOWNLOAD_DATA;
        buf[k++] = 8 * 4;
        for (i = 0; i < 8; i++) {
            unsigned address = addr + words_read*4 + i*32*4;
            buf[k++] = address;
            buf[k++] = address >> 8;
            buf[k++] = address >> 16;
            buf[k++] = address >> 24;
        }
        pickit2_send_buf (a, buf, k);

        for (k = 0; k < 8; k++) {
            /* Read progmem. */
            pickit2_send (a, 17, CMD_CLEAR_UPLOAD_BUFFER,
                CMD_EXECUTE_SCRIPT, 13,
                    SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
                    SCRIPT_JT2_XFRFASTDAT_LIT,
                        0x20, 0, 1, 0,          // READ
                    SCRIPT_JT2_XFRFASTDAT_BUF,
                    SCRIPT_JT2_WAIT_PE_RESP,
                    SCRIPT_JT2_GET_PE_RESP,
                    SCRIPT_LOOP, 1, 31,
                CMD_UPLOAD_DATA_NOLEN);
            pickit2_recv (a);
            memcpy (data, a->reply, 64);
            data += 64/4;
            words_read += 64/4;

            /* Get second half of upload buffer. */
            pickit2_send (a, 1, CMD_UPLOAD_DATA_NOLEN);
            pickit2_recv (a);
            memcpy (data, a->reply, 64);
            data += 64/4;
            words_read += 64/4;
        }
    }
}

/*
 * Put data to download buffer.
 * Max 15 words (60 bytes).
 */
static void download_data (pickit2_adapter_t *a,
    unsigned *data, unsigned nwords, int clear_flag)
{
    unsigned char buf [64];
    unsigned i, k = 0;

    memset (buf, CMD_END_OF_BUFFER, 64);
    if (clear_flag)
        buf[k++] = CMD_CLEAR_DOWNLOAD_BUFFER;
    buf[k++] = CMD_DOWNLOAD_DATA;
    buf[k++] = nwords * 4;
    for (i=0; i<nwords; i++) {
        unsigned word = *data++;
        buf[k++] = word;
        buf[k++] = word >> 8;
        buf[k++] = word >> 16;
        buf[k++] = word >> 24;
    }
    pickit2_send_buf (a, buf, k);
}

/*
 * Flash write, 1-kbyte blocks.
 */
static void pickit2_program_data (adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;
    unsigned words_written;

fprintf (stderr, "PICkit2: program %d bytes at %08x\n", nwords*4, addr);
    if (! a->use_executable) {
        /* Without PE. */
        fprintf (stderr, "PICkit2: slow flash write not implemented yet.\n");
        exit (-1);
    }
    /* Use PE to write flash memory. */
    unsigned nbytes = nwords * 4;
    pickit2_send (a, 20, CMD_CLEAR_UPLOAD_BUFFER,
        CMD_EXECUTE_SCRIPT, 17,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
            SCRIPT_JT2_XFRFASTDAT_LIT,
                0, 0, 2, 0,                     // PROGRAM
            SCRIPT_JT2_XFRFASTDAT_LIT,
                (unsigned char) addr,
                (unsigned char) (addr >> 8),
                (unsigned char) (addr >> 16),
                (unsigned char) (addr >> 24),
            SCRIPT_JT2_XFRFASTDAT_LIT,
                (unsigned char) nbytes,
                (unsigned char) (nbytes >> 8),
                (unsigned char) (nbytes >> 16),
                (unsigned char) (nbytes >> 24));

    for (words_written = 0; words_written < nwords; ) {
        /* Download 256 bytes of data. */
        download_data (a, data, 15, 1);
        download_data (a, data+15, 15, 0);
        download_data (a, data+30, 15, 0);
        download_data (a, data+45, 15, 0);

        pickit2_send (a, 26,
            CMD_DOWNLOAD_DATA, 4*4,
                WORD_AS_BYTES (data[60]),
                WORD_AS_BYTES (data[61]),
                WORD_AS_BYTES (data[62]),
                WORD_AS_BYTES (data[63]),
            CMD_EXECUTE_SCRIPT, 6,              // execute
                SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_LOOP, 1, 63);

        data += 256/4;
        words_written += 256/4;
    }
    //check_timeout (a, "9");                   // Any timeouts?

    pickit2_send (a, 6, CMD_CLEAR_UPLOAD_BUFFER,
        CMD_EXECUTE_SCRIPT, 2,
            SCRIPT_JT2_GET_PE_RESP,
            SCRIPT_JT2_GET_PE_RESP,
        CMD_UPLOAD_DATA);
    pickit2_recv (a);
    //fprintf (stderr, "PICkit2: program PE response %u bytes: %02x...\n",
    //  a->reply[0], a->reply[1]);
    if (a->reply[0] != 8 || a->reply[1] != 0) { // response code 0 = success
        fprintf (stderr, "PICkit2: failed to program flash memory at %08x\n",
            addr);
        exit (-1);
    }
}

/*
 * Erase all flash memory.
 */
static void pickit2_erase_chip (adapter_t *adapter)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;

    //fprintf (stderr, "PICkit2: erase chip\n");
    pickit2_send (a, 11, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 8,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_ERASE,
        SCRIPT_DELAY_LONG, 74);                 // 400 msec
    check_timeout (a, "7");                     // Any timeouts?
}

/*
 * Инициализация адаптера F2232.
 * Возвращаем указатель на структуру данных, выделяемую динамически.
 * Если адаптер не обнаружен, возвращаем 0.
 */
adapter_t *adapter_open_pickit2 (void)
{
    pickit2_adapter_t *a;
    struct usb_bus *bus;
    struct usb_device *dev;

    usb_init();
    usb_find_busses();
    usb_find_devices();
    for (bus = usb_get_busses(); bus; bus = bus->next) {
        for (dev = bus->devices; dev; dev = dev->next) {
            if (dev->descriptor.idVendor == MICROCHIP_VID &&
                (dev->descriptor.idProduct == PICKIT2_PID))
                goto found;
        }
    }
    /*fprintf (stderr, "USB adapter not found: vid=%04x, pid=%04x\n",
        MICROCHIP_VID, PICKIT2_PID);*/
    return 0;
found:
    /*fprintf (stderr, "found USB adapter: vid %04x, pid %04x, type %03x\n",
        dev->descriptor.idVendor, dev->descriptor.idProduct,
        dev->descriptor.bcdDevice);*/
    a = calloc (1, sizeof (*a));
    if (! a) {
        fprintf (stderr, "Out of memory\n");
        return 0;
    }
    a->usbdev = usb_open (dev);
    if (! a->usbdev) {
        fprintf (stderr, "PICkit2: usb_open() failed\n");
        free (a);
        return 0;
    }
    if (usb_set_configuration (a->usbdev, 2) < 0) {
        fprintf (stderr, "PICkit2: cannot set USB configuration\n");
failed: usb_release_interface (a->usbdev, IFACE);
        usb_close (a->usbdev);
        free (a);
        return 0;
    }
    if (usb_claim_interface (a->usbdev, IFACE) < 0) {
        fprintf (stderr, "PICkit2: cannot claim USB interface\n");
        goto failed;
    }

    /* Read version of adapter. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_GET_VERSION);
    pickit2_recv (a);
    printf ("PICkit2: Version %d.%d.%d\n",
        a->reply[0], a->reply[1], a->reply[2]);

    /* Detach power from the board. */
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_VDD_OFF,
        SCRIPT_VDD_GND_ON);

    /* Setup power voltage 3.3V, fault limit 2.81V. */
    unsigned vdd = (unsigned) (3.3 * 32 + 10.5) << 6;
    unsigned vdd_limit = (unsigned) ((2.81 / 5) * 255);
    pickit2_send (a, 4, CMD_SET_VDD, vdd, vdd >> 8, vdd_limit);

    /* Setup reset voltage 3.28V, fault limit 2.26V. */
    unsigned vpp = (unsigned) (3.28 * 18.61);
    unsigned vpp_limit = (unsigned) (2.26 * 18.61);
    pickit2_send (a, 4, CMD_SET_VPP, 0x40, vpp, vpp_limit);

    /* Setup serial speed. */
    unsigned divisor = 10;
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_SET_ICSP_SPEED, divisor);

