dany994/vak-opensource/trunk/microcontrollers/pic32prog/adapter-pickit2.c
    /* Reset active low. */
    pickit2_send (a, 3, CMD_EXECUTE_SCRIPT, 1,
        SCRIPT_MCLR_GND_ON);

    /* Read board status. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_READ_STATUS);
    pickit2_recv (a);
    unsigned status = a->reply[0] | a->reply[1] << 8;
    if (debug_level > 0)
        fprintf (stderr, "PICkit2: status %04x\n", status);
    if ((status & ~STATUS_RESET) != (STATUS_VDD_GND_ON | STATUS_VPP_GND_ON)) {
        fprintf (stderr, "PICkit2: invalid status = %04x\n", status);
        goto failed;
    }

    /* Enable power to the board. */
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_VDD_GND_OFF,
        SCRIPT_VDD_ON);

    /* Read board status. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_READ_STATUS);
    pickit2_recv (a);
    status = a->reply[0] | a->reply[1] << 8;
    if (debug_level > 0)
        fprintf (stderr, "PICkit2: status %04x\n", status);
    if (status != (STATUS_VDD_ON | STATUS_VPP_GND_ON)) {
        fprintf (stderr, "PICkit2: invalid status = %04x.\n", status);
        goto failed;
    }

    /* Enter programming mode. */
    pickit2_send (a, 42, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 39,
        SCRIPT_VPP_OFF,
        SCRIPT_MCLR_GND_ON,
        SCRIPT_VPP_PWM_ON,
        SCRIPT_BUSY_LED_ON,
        SCRIPT_SET_ICSP_PINS, 0,
        SCRIPT_DELAY_LONG, 20,                  // 100 msec
        SCRIPT_MCLR_GND_OFF,
        SCRIPT_VPP_ON,
        SCRIPT_DELAY_SHORT, 23,                 // 1 msec
        SCRIPT_VPP_OFF,
        SCRIPT_MCLR_GND_ON,
        SCRIPT_DELAY_SHORT, 47,                 // 2 msec
        SCRIPT_WRITE_BYTE_LITERAL, 0xb2,
        SCRIPT_WRITE_BYTE_LITERAL, 0xc2,
        SCRIPT_WRITE_BYTE_LITERAL, 0x12,
        SCRIPT_WRITE_BYTE_LITERAL, 0x0a,
        SCRIPT_MCLR_GND_OFF,
        SCRIPT_VPP_ON,
        SCRIPT_DELAY_LONG, 2,                   // 10 msec
        SCRIPT_SET_ICSP_PINS, 2,
        SCRIPT_JT2_SETMODE, 6, 0x1f,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_STATUS);
    pickit2_send (a, 1, CMD_UPLOAD_DATA);
    pickit2_recv (a);
    if (debug_level > 1)
        fprintf (stderr, "PICkit2: got %02x-%02x\n", a->reply[0], a->reply[1]);
    if (a->reply[0] != 1 || ! (a->reply[1] & 0x80)) {
        fprintf (stderr, "Device is code protected and must be erased first.\n");

        /* Exit programming mode. */
        pickit2_send (a, 18, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 15,
            SCRIPT_JT2_SETMODE, 5, 0x1f,
            SCRIPT_VPP_OFF,
            SCRIPT_MCLR_GND_ON,
            SCRIPT_VPP_PWM_OFF,
            SCRIPT_SET_ICSP_PINS, 6,
            SCRIPT_SET_ICSP_PINS, 2,
            SCRIPT_SET_ICSP_PINS, 3,
            SCRIPT_DELAY_LONG, 10,              // 50 msec
            SCRIPT_BUSY_LED_OFF);
        goto failed;
    }

    /* User functions. */
    a->adapter.close = pickit2_close;
    a->adapter.get_idcode = pickit2_get_idcode;
    a->adapter.load_executable = pickit2_load_executable;
    a->adapter.read_word = pickit2_read_word;
    a->adapter.read_data = pickit2_read_data;
    a->adapter.erase_chip = pickit2_erase_chip;
    a->adapter.program_data = pickit2_program_data;
    return &a->adapter;
}
